{"backend": "tensorflow", "config": {"input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, null, 100], "dtype": "float32", "name": "encoder_inputs", "sparse": false}, "name": "encoder_inputs", "class_name": "InputLayer"}, {"inbound_nodes": [], "config": {"batch_input_shape": [null, null, 100], "dtype": "float32", "name": "decoder_inputs", "sparse": false}, "name": "decoder_inputs", "class_name": "InputLayer"}, {"inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "config": {"kernel_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "recurrent_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "activity_regularizer": null, "name": "encoder_lstm", "trainable": true, "implementation": 1, "recurrent_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "return_sequences": false, "bias_constraint": null, "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "return_state": true, "unit_forget_bias": true}, "name": "encoder_lstm", "class_name": "LSTM"}, {"inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "config": {"kernel_constraint": null, "dropout": 0.0, "kernel_regularizer": null, "recurrent_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "activity_regularizer": null, "name": "decoder_lstm", "trainable": true, "implementation": 1, "recurrent_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "return_sequences": true, "bias_constraint": null, "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "return_state": true, "unit_forget_bias": true}, "name": "decoder_lstm", "class_name": "LSTM"}, {"inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "units": 1363, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "decoder_dense", "trainable": true}, "name": "decoder_dense", "class_name": "Dense"}], "output_layers": [["decoder_dense", 0, 0]]}, "keras_version": "2.2.0", "class_name": "Model"}